# Load SQL and Connect to DB

In [2]:
%load_ext sql

**Connect to DB**

In [48]:
%env DATABASE_URL = postgresql://shubham_sms_user:shubham@172.25.87.65:5432/shubham_sms_db

env: DATABASE_URL=postgresql://shubham_sms_user:shubham@172.25.87.65:5432/shubham_sms_db

# Filtering Data

**Let us uderstand how we can filter the data as part of queries**

## We use **WHERE** close to filter the data
   - All comparison operators such as **=, !=, >, <, <= , >=** etc can be used to compare a column or expression or literal with another column or expression or literal.

In [8]:
%%sql

select * from shubham.orders
    where order_status = 'COMPLETE'
        limit 10;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
10 rows affected.

[(3, datetime.datetime(2013, 7, 25, 0, 0), 12111, 'COMPLETE'),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'COMPLETE'),
 (6, datetime.datetime(2013, 7, 25, 0, 0), 7130, 'COMPLETE'),
 (7, datetime.datetime(2013, 7, 25, 0, 0), 4530, 'COMPLETE'),
 (15, datetime.datetime(2013, 7, 25, 0, 0), 2568, 'COMPLETE'),
 (17, datetime.datetime(2013, 7, 25, 0, 0), 2667, 'COMPLETE'),
 (22, datetime.datetime(2013, 7, 25, 0, 0), 333, 'COMPLETE'),
 (26, datetime.datetime(2013, 7, 25, 0, 0), 7562, 'COMPLETE'),
 (28, datetime.datetime(2013, 7, 25, 0, 0), 656, 'COMPLETE'),
 (32, datetime.datetime(2013, 7, 25, 0, 0), 3960, 'COMPLETE')]

- Before checking the conditions we can see the distinct data for the condition column to avoide the error.

In [7]:
%%sql 
    select distinct(order_status) from shubham.orders;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
9 rows affected.

[('COMPLETE',),
 ('ON_HOLD',),
 ('PENDING_PAYMENT',),
 ('PENDING',),
 ('CLOSED',),
 ('CANCELED',),
 ('PROCESSING',),
 ('PAYMENT_REVIEW',),
 ('SUSPECTED_FRAUD',)]

- To check the complete data of the condition

In [9]:
%%sql 

select count(order_status)
    from shubham.orders
        where order_status ='COMPLETE';

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
1 rows affected.

[(22899,)]

## Boolen OR and AND can be performed when we want to apply multiple conditions.
   - Get all orders with order_status equals to COMPLETE or CLOSED.
   - Get all orders from month 2014 January with order_status equals to COMPLETE or CLOSED

   - we will use **IN** instad of **OR** Oprator because it looks more readable code we will get same result with **OR** oprator also
   - We will see that both the count is same with **IN** and with **OR** i.e **30455**

In [12]:
%%sql 

    select * from shubham.orders
        where order_status IN ('COMPLETE','CLOSED')
            Limit 10;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 11599, 'CLOSED'),
 (3, datetime.datetime(2013, 7, 25, 0, 0), 12111, 'COMPLETE'),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED'),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'COMPLETE'),
 (6, datetime.datetime(2013, 7, 25, 0, 0), 7130, 'COMPLETE'),
 (7, datetime.datetime(2013, 7, 25, 0, 0), 4530, 'COMPLETE'),
 (12, datetime.datetime(2013, 7, 25, 0, 0), 1837, 'CLOSED'),
 (15, datetime.datetime(2013, 7, 25, 0, 0), 2568, 'COMPLETE'),
 (17, datetime.datetime(2013, 7, 25, 0, 0), 2667, 'COMPLETE'),
 (18, datetime.datetime(2013, 7, 25, 0, 0), 1205, 'CLOSED')]

In [14]:
%%sql 

    select Count(order_status) from shubham.orders
        where order_status IN ('COMPLETE','CLOSED')
            Limit 10;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
1 rows affected.

[(30455,)]

In [13]:
%%sql 

    select * from shubham.orders
        where order_status ='COMPLETE' OR order_status = 'CLOSED'
            Limit 10;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 11599, 'CLOSED'),
 (3, datetime.datetime(2013, 7, 25, 0, 0), 12111, 'COMPLETE'),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED'),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'COMPLETE'),
 (6, datetime.datetime(2013, 7, 25, 0, 0), 7130, 'COMPLETE'),
 (7, datetime.datetime(2013, 7, 25, 0, 0), 4530, 'COMPLETE'),
 (12, datetime.datetime(2013, 7, 25, 0, 0), 1837, 'CLOSED'),
 (15, datetime.datetime(2013, 7, 25, 0, 0), 2568, 'COMPLETE'),
 (17, datetime.datetime(2013, 7, 25, 0, 0), 2667, 'COMPLETE'),
 (18, datetime.datetime(2013, 7, 25, 0, 0), 1205, 'CLOSED')]

In [15]:
%%sql 

    select count(order_status) from shubham.orders
        where order_status ='COMPLETE' OR order_status = 'CLOSED'
            Limit 10;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
1 rows affected.

[(30455,)]

## We can use oerators such as LIKE with % or ~ with regular expressions for pattern matching

- we will now filter the data based on the DATE 
- we will filte the data based on date = 2014-01-01 00:00:00.0 in postgress it will work because database supports this formate. date = 2014-01-01 will also give the same result.
- we can validate this by the count as below 
- different different datbase have their own syntex so we need to follow that

In [19]:
%%sql 
    
    select * from shubham.orders
        where order_date = '2014-01-01 00:00:00.0'
            limit 10;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
10 rows affected.

[(25876, datetime.datetime(2014, 1, 1, 0, 0), 3414, 'PENDING_PAYMENT'),
 (25877, datetime.datetime(2014, 1, 1, 0, 0), 5549, 'PENDING_PAYMENT'),
 (25878, datetime.datetime(2014, 1, 1, 0, 0), 9084, 'PENDING'),
 (25879, datetime.datetime(2014, 1, 1, 0, 0), 5118, 'PENDING'),
 (25880, datetime.datetime(2014, 1, 1, 0, 0), 10146, 'CANCELED'),
 (25881, datetime.datetime(2014, 1, 1, 0, 0), 3205, 'PENDING_PAYMENT'),
 (25882, datetime.datetime(2014, 1, 1, 0, 0), 4598, 'COMPLETE'),
 (25883, datetime.datetime(2014, 1, 1, 0, 0), 11764, 'PENDING'),
 (25884, datetime.datetime(2014, 1, 1, 0, 0), 7904, 'PENDING_PAYMENT'),
 (25885, datetime.datetime(2014, 1, 1, 0, 0), 7253, 'PENDING')]

In [20]:
%%sql 
    
    select count(order_date) from shubham.orders
        where order_date = '2014-01-01 00:00:00.0'
            limit 10;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
1 rows affected.

[(135,)]

In [21]:
%%sql 
    
    select * from shubham.orders
        where order_date = '2014-01-01'
            limit 10;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
10 rows affected.

[(25876, datetime.datetime(2014, 1, 1, 0, 0), 3414, 'PENDING_PAYMENT'),
 (25877, datetime.datetime(2014, 1, 1, 0, 0), 5549, 'PENDING_PAYMENT'),
 (25878, datetime.datetime(2014, 1, 1, 0, 0), 9084, 'PENDING'),
 (25879, datetime.datetime(2014, 1, 1, 0, 0), 5118, 'PENDING'),
 (25880, datetime.datetime(2014, 1, 1, 0, 0), 10146, 'CANCELED'),
 (25881, datetime.datetime(2014, 1, 1, 0, 0), 3205, 'PENDING_PAYMENT'),
 (25882, datetime.datetime(2014, 1, 1, 0, 0), 4598, 'COMPLETE'),
 (25883, datetime.datetime(2014, 1, 1, 0, 0), 11764, 'PENDING'),
 (25884, datetime.datetime(2014, 1, 1, 0, 0), 7904, 'PENDING_PAYMENT'),
 (25885, datetime.datetime(2014, 1, 1, 0, 0), 7253, 'PENDING')]

In [22]:
%%sql 
    
    select count(order_date) from shubham.orders
        where order_date = '2014-01-01'
            limit 10;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
1 rows affected.

[(135,)]

 - if we use LIKE to filter data by pattern in the date then it will give us an error as below

In [24]:
%%sql 
    
    select * from shubham.orders
        where order_date LIKE '2014-01%'
            limit 10;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
(psycopg2.errors.UndefinedFunction) operator does not exist: timestamp without time zone ~~ unknown
LINE 2:         where order_date LIKE '2014-01%'
                                 ^
HINT:  No operator matches the given name and argument types. You might need to add explicit type casts.

[SQL: select * from shubham.orders
        where order_date LIKE '2014-01%%'
            limit 10;]
(Background on this error at: https://sqlalche.me/e/14/f405)

- to resolve this first we need to convert the date into the string with the help of the TO_CHAR() function then we can use the LIKE in this date field also

In [25]:
%%sql 

    select * from shubham.orders
        where order_status IN ('COMPLETE', 'CLOSED')
            AND to_char(order_date, 'yyyy-MM-dd') LIKE '2014-01%'
                limit 10;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
10 rows affected.

[(25882, datetime.datetime(2014, 1, 1, 0, 0), 4598, 'COMPLETE'),
 (25888, datetime.datetime(2014, 1, 1, 0, 0), 6735, 'COMPLETE'),
 (25889, datetime.datetime(2014, 1, 1, 0, 0), 10045, 'COMPLETE'),
 (25891, datetime.datetime(2014, 1, 1, 0, 0), 3037, 'CLOSED'),
 (25895, datetime.datetime(2014, 1, 1, 0, 0), 1044, 'COMPLETE'),
 (25897, datetime.datetime(2014, 1, 1, 0, 0), 6405, 'COMPLETE'),
 (25898, datetime.datetime(2014, 1, 1, 0, 0), 3950, 'COMPLETE'),
 (25899, datetime.datetime(2014, 1, 1, 0, 0), 8068, 'CLOSED'),
 (25900, datetime.datetime(2014, 1, 1, 0, 0), 2382, 'CLOSED'),
 (25901, datetime.datetime(2014, 1, 1, 0, 0), 3099, 'COMPLETE')]

In [28]:
%%sql 

    select count (*) from shubham.orders
        where order_status IN ('COMPLETE', 'CLOSED')
            AND to_char(order_date, 'yyyy-MM-dd') LIKE '2014-01%'
                limit 10;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
1 rows affected.

[(2544,)]

- We can also use the **~** oprator for the pattern matching 
- Here we will only see the count not the full data

In [30]:
%%sql 

    select count (*) from shubham.orders
        where order_status IN ('COMPLETE', 'CLOSED')
            AND to_char(order_date, 'yyyy-MM') ~ '2014-01'
                limit 10;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
1 rows affected.

[(2544,)]

## We Can also use BETWEEN along with AND to compare a column or expression against range of values.

- Between is use for the filter the data in perticuler range
- so first we will see the minimum and maximum values of the date and then we will use the **BETWEEN*

In [34]:
%%sql 

    select min(order_date) from shubham.orders
        where order_date BETWEEN '2014-01-01' AND '2014-03-31'

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
1 rows affected.

[(datetime.datetime(2014, 1, 1, 0, 0),)]

In [35]:
%%sql 

    select max(order_date) from shubham.orders
        where order_date BETWEEN '2014-01-01' AND '2014-03-31'

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
1 rows affected.

[(datetime.datetime(2014, 3, 31, 0, 0),)]

In [37]:
%%sql 
    
    select * from shubham.orders
        where order_status in ('COMPLETE','CLOSED')
            and order_date between '2014-01-01' and '2014-03-31'
                limit 10;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
10 rows affected.

[(25882, datetime.datetime(2014, 1, 1, 0, 0), 4598, 'COMPLETE'),
 (25888, datetime.datetime(2014, 1, 1, 0, 0), 6735, 'COMPLETE'),
 (25889, datetime.datetime(2014, 1, 1, 0, 0), 10045, 'COMPLETE'),
 (25891, datetime.datetime(2014, 1, 1, 0, 0), 3037, 'CLOSED'),
 (25895, datetime.datetime(2014, 1, 1, 0, 0), 1044, 'COMPLETE'),
 (25897, datetime.datetime(2014, 1, 1, 0, 0), 6405, 'COMPLETE'),
 (25898, datetime.datetime(2014, 1, 1, 0, 0), 3950, 'COMPLETE'),
 (25899, datetime.datetime(2014, 1, 1, 0, 0), 8068, 'CLOSED'),
 (25900, datetime.datetime(2014, 1, 1, 0, 0), 2382, 'CLOSED'),
 (25901, datetime.datetime(2014, 1, 1, 0, 0), 3099, 'COMPLETE')]

In [41]:
%%sql 
    
    select count(*), min(order_date), max(order_date), count(distinct(order_date)) from shubham.orders
        where order_status in ('COMPLETE','CLOSED')
            and order_date between '2014-01-01' and '2014-03-31'
                limit 10;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
1 rows affected.

[(7594, datetime.datetime(2014, 1, 1, 0, 0), datetime.datetime(2014, 3, 31, 0, 0), 89)]

## we need to use IS NULL and IS NOT NULL to compare against null values.

- to demonstrate this we need another table witch have null date 
- for this we will use course table and we will enter the dummy data into that with null values

In [57]:
%%sql 

Insert Into shubham.courses 
(
     course_name,
     course_author,
     course_status
)
VALUES
('Web Application - Java Spring', 'Anna', 'draft'),
('Pipeline Orchestration - Python', 'shashi','draft');

Insert into shubham.courses 
(
     course_name,
     course_author,
     course_status
)
values 
('Programming using Scala', 'Mike Nice','published'),
('Programming using Java', 'Sharma Madhu','inactive'),
('Web Application - Python Flask','Sharma Madhu','inactive');

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
2 rows affected.
3 rows affected.

[]

In [59]:
%%sql 
    
    select * from shubham.courses
        where course_published_dt is null;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
6 rows affected.

[(7, 'Web Application - Java Spring', 'Mike Jack', 'draft', None),
 (16, 'Web Application - Java Spring', 'Anna', 'draft', None),
 (17, 'Pipeline Orchestration - Python', 'shashi', 'draft', None),
 (18, 'Programming using Scala', 'Mike Nice', 'published', None),
 (19, 'Programming using Java', 'Sharma Madhu', 'inactive', None),
 (20, 'Web Application - Python Flask', 'Sharma Madhu', 'inactive', None)]

In [60]:
%%sql 
    
    select * from shubham.courses
        where course_published_dt is not null;

 * postgresql://shubham_sms_user:***@172.25.87.65:5432/shubham_sms_db
8 rows affected.

[(1, 'Programming using Python', 'Bob Dillon', 'published', datetime.date(2020, 9, 30)),
 (2, 'Data Engineering using Python', 'Bob Dillon', 'published', datetime.date(2020, 7, 15)),
 (4, 'Programming using Scala', 'Elvis Presley', 'published', datetime.date(2020, 5, 12)),
 (9, 'Streaming Pipelines - Python', 'Bob Dillon', 'published', datetime.date(2020, 10, 5)),
 (11, 'Web Applications - Python Diango', 'Bob Dillon', 'published', datetime.date(2020, 6, 23)),
 (12, 'Server Automation - Ansible', 'Uncle Sam', 'published', datetime.date(2020, 7, 5)),
 (8, 'Pipeline Orchestration - Python', 'Bob Dillon', 'published', datetime.date(2022, 11, 16)),
 (3, 'Data Engineering using Scala', 'Elvis Presley', 'published', datetime.date(2022, 11, 16))]